{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Engineering",
      "department": "Computer Engineering",
      "duration": "2018-2023",
      "school_name": "Toronto Metropolitan University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_VincentPhung",
  "highlighted_projects": [
    {
      "description": "Developed the frontend for this application using ReactJS which includes a dynamic map. This application is a distributed system that communicates with multiple services using RabbitMQ to determine priority and optimal routes for emergency vehicles in the case of disaster on a user-generated map. The server's endpoints were created with FastAPI and Python. Both the server and client applications were run on Docker containers and hosted on Microsoft Azure.",
      "git_url": null,
      "name": "Disaster Response System"
    },
    {
      "description": "Created a full-stack web application that allows users to log in and view a catalog of different beverages and assign them ratings using Java and Apache Tomcat. The beverages info and user reviews/ratings were stored in a MySQL database. The application was built with the MVC design pattern in mind, to separate the main components of the application.",
      "git_url": null,
      "name": "Online Beverage Catalogue"
    },
    {
      "description": "Developed the UI components for the application using ReactJS and Javascript. The application is real-time messaging web application using sockets (Socket.io) and ML libraries, which allows for the application to pick certain phrases to create events in google calendar such as a doctor's appointment. The backend was created using Java and Spring Boot and Firebase was used for hosting.",
      "git_url": null,
      "name": "Chatter"
    },
    {
      "description": "Built a web application that allows the user to search up information of various Pokemon using NodeJS, Express.js, MongoDB, and EJS. I implemented Express to handle the routing for all the RESTful endpoints for all the pokemon. I also utilized the web speech API to have speech recognition and speech synthesis on the application.",
      "git_url": "https://github.com/VincentP05/MyPoked3x",
      "name": "Pokedex"
    },
    {
      "description": "Created scripts that mimic a rover defusing mines in a 2D map. Built the server service API using FastAPI to handle various calls from various clients. Utilized RabbitMQ as the messaging broker to put the requests from clients into a queue. The client and server were both put into docker containers and hosted on Microsoft Azure.",
      "git_url": null,
      "name": "Mine Diffuser"
    },
    {
      "description": "Implemented an object detection script for the autonomous ping pong collector rover and also created data sets to train the object detection model. The rover uses a jetson nano, arduino uno, and pre-existing object detection/avoidance models.",
      "git_url": null,
      "name": "Autonomous Ping Pong Collector"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a Linux cluster monitoring agent that allows users to monitor nodes/machines and get the host machine's hardware specification and current memory usage data through bash scripts.  A job scheduler, Crontab was also used to get the host's usage data in regular minute intervals.  The information is persisted in a Postgres database that's run on a Docker container.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Monitor"
    },
    {
      "description": "Implemented and executed various SQL queries on PostgresSQL tables. Utilized DBeaver as an interface for query execution. Utilized SQL Queries to perform CRUD operations, joins, aggregation functions, and other techniques.",
      "git_url": "/linux_sql/sql",
      "name": "SQL Queries"
    },
    {
      "description": "Implemented a grep app in Java that allows the user to search through files in a specified directory for a specific string pattern declared by the user and have those matching lines outputted to a file. The project was built using Maven, and the whole application is dockerized.",
      "git_url": "/core_java/grep",
      "name": "Java Grep App"
    },
    {
      "description": "Developed a application that simulates real-time stock buying and selling in Java 11. The application utilizes the Alpha Vantage API to get real-time stock market data in JSON, utilizing the OkHttp library for managing HTTP requests. Then the application processes the data using the Jackson library to convert the JSON object into a Java object. This object is then processed and saved in the Postgres database. The entire application runs in a Docker container. Design patterns utilized in this application include the DAO pattern, the Repository pattern, and the MVC (Model-View-Controller) pattern. Junit and Mockito were utilized to perform unit and integration testing to ensure the application is reliable and accurate.",
      "git_url": "/core_java/jdbc",
      "name": "Java Stock Quote App"
    }
  ],
  "name": "Vincent Phung",
  "others": [
    {
      "bullets": [
        "Fishing, I've been fishing for quite years now. My favourite fishes to catch are bass and trout. I've mainly only done fresh water fishing, but I want to try fishing in the ocean at least once.",
        "Calisthenics, I recently transitioned from weight lifting to calisthenics, and I really enjoy learning more skills. I'm currently trying to learn how to do the back lever and handstand push up.",
        "Basketball, I don't play as much basketball as I use to, so I've been mainly just watching basketball. My favourite team currently is OKC, and my favourite player in the league is Kyrie Irving.",
        "TFT and trading card games are some of my other hobbies, I enjoy playing auto chess battlers like Team Fight Tactics. I also like playing card games like Yugi-Oh and Pokemon."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed applications using technologies including Bash, Git, Postgres, Docker, Java, Springboot, Python, Javascript, Typescript, Hadoop, and Spark using Agile methodology. Applications include a linux cluster monitoring agent, stock quote application, RESTful API for trading platform, and trading platform application",
      "duration": "2023-present",
      "title": "Junior Software Developer"
    },
    {
      "company": "Ontario Ministry of Health and Longterm Care",
      "description": "Worked in the public health I\u0026IT solutions branch. Worked in the Salesforce developer environment completing user stories for the critical case and contact management application, which was used to track and log cases of COVID outbreaks and cases in Ontario. Used different technologies including Apex, SOQL, and Visual Force (equivalent to Java, MySQL, and ReactJs). Introduced to agile development and version control in a large team setting using git. Coordinated with the QA team to identify bugs and defects to report to the development team. Learned about data remediation, and applied it to multiple SOQL databases, resulting in more accurate and higher quality data.",
      "duration": "2021-2022",
      "title": "Software Developer Intern"
    }
  ],
  "skills": {
    "competent": [
      "ReactJS",
      "Typescript",
      "MongoDB/NoSQL",
      "Node.js",
      "Express.js",
      "Tailwind",
      "RDBMS/MySQL/Postgres/SQL",
      "RESTful APIs",
      "Docker",
      "Junit",
      "Salesforce"
    ],
    "familiar": [
      "C",
      "VHDL",
      "Oracle",
      "MATLAB",
      "RabbitMQ",
      "Postman"
    ],
    "proficient": [
      "Javascript",
      "Python",
      "Java",
      "Linux/Bash",
      "HTML5/CSS3",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I'm currently a junior software engineer at Jarvis Consulting Group. I recently graduated with a Bachelor's degree in Computer Engineering, specializing in Software Engineering, from Toronto Metropolitan University in June 2023. I have taken courses including Object Oriented Programming, Database design, Algorithms and Data Structures, Operating Systems, and Software Design and Architecture. I have previous experience working as a software developer intern with the Ontario Ministry of Health and Long-term Care, where I worked on the COVID case and contact management system using Apex, SOQL, Visual Force, and JavaScript (Equivalent to Java, MySQL, and ReactJS). What excites me about this field is the opportunity to transform innovative ideas into tangible, impactful solutions. I find satisfaction in continuous learning, embracing new technologies, and translating them into real-world applications. My main interests in the field of technology are fintech, blockchain technology, and game development. In my spare time, one of the things I enjoy doing is turning some of my ideas into fun projects that include full-stack web applications and bots. Some of these projects include a discord bot that manages the creation, organization, and brackets for Pokémon showdown tournaments among my friends. There's also a full-stack web application calisthenics progress tracker, that allows users to track their progress and make sure they're learning the skills in the correct order, which I'm currently working on."
}
